Revit 2016 API
DWGImportOptions Methods
The DWGImportOptions type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from BaseImportOptions.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLayerSelection
 Get all set layers name which user want to import into Revit.
 (Inherited from BaseImportOptions.)
GetLineWeights
 Gets array of line weights.
GetRefPoint |  Obsolete.
 Gets the 3D point in the document where the imported instance will be inserted.
 (Inherited from BaseImportOptions.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetLayerSelection
 Set the layers name which user want to import into Revit.
 (Inherited from BaseImportOptions.)
SetLineWeights
 Set array of line weights.
SetRefPoint |  Obsolete.
 Sets the 3D point in the document where the imported instance will be inserted. If not explicitly set, the instance will be inserted at the document origin.
 (Inherited from BaseImportOptions.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DWGImportOptions Class
Autodesk.Revit.DB Namespace